Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>J/DDxl/5MLmhnJ8cHLBaeUkHTUwHp1QoO1rt6kz0sg1clq2sLl84P8cgjUpQ4prAToDzRvQCKsJR&#13;
qrG8qN2jVXZo+fTu1x1mInV5LLh5C1KiWXf/fc965PZWxd///AWnbdnCOh3qzsyklvvd/IxY2DNw&#13;
QHjvVI+gb6AS5zpEjrPHLDcNC7bJowKYbazqqE7i1Ghq9ypdB5RufQjOcLFIdXXRCs/+imNssbr1&#13;
Ga80FH3nszp50RVyDY1cJUJI5Yy7eVyVzD1+gh7mOr0ftuHzzt4RTTUrzRaoi2KPtJlubmf9VvOU&#13;
tySWJIDQnWQrIL88VpAHiPFLKpoRjfm/Y6cIqg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>0Z3yiwtyuk3QgxmXk8Go/K7vXgKNjpovZ5rMIo5rFo7QyzbJh1VxEV2GfNTOqyhCBhgcp+uShkFD&#13;
FoiYv/yBNyZMkBdD0e7AU4CJnopAu49SqXDMd2YcrCYjfSAQNBgTNiYvu17nleJYTDnmL6sIix58&#13;
eNwGEyUrOqOheJ8luzxsVvMolgTUVVeP9t0Lq3tuVV9IjzCva99KwZhGQldSKsU/jRogk8/Skieq&#13;
zb+ErSXwF9lSBJ8/Ff/4ETXzOUz6IPYN4GWtXT+lbaBjKmXMbNnxf5q/7CKu19+cczZy+6ZdNOcK&#13;
/7Vjl4qg3EDjmtVsfDQf11W5mjafhvUvXkAiK4yOiS+XthGbF9uhlRkJdD66j/1WQv2tdn2+gypO&#13;
VAMt3lRMKVoTJh+HWrsBxaXiyi8laRDvpTnk2il2WaMf7EzPCRAF7lxdxjc731Z75H5+VpKpHTL3&#13;
u6//U2qo9NDwzUByRYe07Dz3Kq2qH0UmDt3sd5PTzExp5Otg+JD9hLcVuOsFTI4xlKFmLOucA0Rw&#13;
6yINxESb7z5ZXqDufnyOH3RyB8GjtpIcgFCGPWdi6ET/Yh+BL8wmsq7s/O2vaizLzBM6jfVd0Yc4&#13;
Hv/LGmKEKx2sIjAdOHaLz5PUsxEEPjEd0TIUJ9We1P1bwIlfeAH0prO853LnN+EzfdSpmvVD2rgH&#13;
79vrnlWjpvz6fM3/spM3zX3HR58S0jWM4zg4YrrgYMaPHPoJOKGhwf4+K3TwIga+od5DErDvqGAw&#13;
BteMfzyMSTui+N3vD3yKHU7+Fnq9o/eVdqXawb8xgb2Qzx/GCHprlvG4uX+DxnWGrTniw/nKmiLl&#13;
g8LeaC+hOEnFK2z1JlcajncTgF/rhsgqKZyR7DO3n4uYBfHA4QHta9c1TxyL/+KWtdVtk99qHbVN&#13;
1c6DFoJn9pPLeRUqrAQKUi0acTHJvCA41j9lhMiSm6y7fvdj</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>P3VTCHgbboBNN+2ie+0oIJ8PgKA=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
nFCxXpbciukdBreWPvBYzOl0V79W0AEHIPSbqx0VXh4CgiMo7rI3gMCglzp/gnc/Z6hO8j6+sgxL&#13;
xktF0fFQLU3SEhqpdfEzIeGSCTa3kg1zsp/ne4CDBjEc2CqZQVJlLHjfOO7ZvsPCfSk/25bY1nRn&#13;
zAqMB+2oinVeSUioPwqEGsE5VwwaZzPZqUh0iqd6U4VP0wu7XnvobUXmkV+ZKSTsmZhhHuv3Cq0D&#13;
qhdCelaXDZa3mDbsqvAc3zl90fNvfvY+4QeEtV2fE7AKxzz1HCuy5Tko5P37ZpzthRq8o+yx7kgM&#13;
nmFCu71RaaMK4YUyutDralbLP5RE2D2ErWq/ZA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>